app/views/bimdosens/index.html.erb

        <td><%= bimdosen.nim %></td>
        <td><%= Student.find(bimdosen.nim).nama %></td>
---
SELECT "students".* FROM "students" WHERE "students"."nim" = ? LIMIT ?  [["nim", 19091], ["LIMIT", 1]]