app/views/admins/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."admin_id" = ? LIMIT ?  [["admin_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= admin.nama %></td>
        <td> <%= User.find(admin.id).email%></td>
          <td> <%= User.find(admin.id).encrypted_password%></td>