app/views/students/index.html.erb

SELECT "mahasiswas".* FROM "mahasiswas" WHERE "mahasiswas"."nim" = ? LIMIT ?  [["nim", 19090], ["LIMIT", 1]]
---

        <td><%= Mahasiswa.find(student.nim).email%></td>