app/views/bimbingans/index.html.erb

SELECT "students".* FROM "students" WHERE "students"."nim" = ? LIMIT ?  [["nim", 19090], ["LIMIT", 1]]
---
        <td><%= bimbingan.nim %></td>
        <td><%= Student.find(bimbingan.nim).nama %></td>

SELECT "dosens".* FROM "dosens" WHERE "dosens"."nip" = ? LIMIT ?  [["nip", 1090], ["LIMIT", 1]]
---
        <td><%= bimbingan.nip%></td>
        <td><%= Dosen.find(bimbingan.nip).nama %></td>