app/views/dosens/index.html.erb

SELECT "mdosens".* FROM "mdosens" WHERE "mdosens"."nip" = ? LIMIT ?  [["nip", 1090], ["LIMIT", 1]]
---
        <td><%= dosen.nama %></td>
        <td><%= Mdosen.find(dosen.nip).email %></td>