app/views/babs/index.html.erb

        <td><%= bimbingan.nim %></td>
        <td><%= Student.find(bimbingan.nim).nama %></td>
        <td><%= bimbingan.judul %></td>
        <td><%= Dosen.find(bimbingan.nip).nama %></td>
---
SELECT "students".* FROM "students" WHERE "students"."nim" = ? LIMIT ?  [["nim", 19090], ["LIMIT", 1]]
SELECT "dosens".* FROM "dosens" WHERE "dosens"."nip" = ? LIMIT ?  [["nip", 1090], ["LIMIT", 1]]

        <td><%= bab.nim %></td>
         <td><%= Student.find(bab.nim).nama %></td>
---
SELECT "students".* FROM "students" WHERE "students"."nim" = ? LIMIT ?  [["nim", 19090], ["LIMIT", 1]]