app/views/babs/show.html.erb

<p>Comments</p>
<% @bab.sarans.each do |comment| %>
---
SELECT "sarans".* FROM "sarans" WHERE "sarans"."bab_id" = ?  [["bab_id", 2]]