app/controllers/admins_controller.rb

INSERT INTO "admins" ("nama", "username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nama", "lek"], ["username", "a"], ["password", "a"], ["created_at", "2019-08-26 01:14:42.169319"], ["updated_at", "2019-08-26 01:14:42.169319"]]
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save

UPDATE "admins" SET "nama" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["nama", "Chankaya"], ["updated_at", "2019-08-26 07:42:48.186651"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @admin.update(admin_params)