app/controllers/babs_controller.rb

  def index
    @bimbas = Bimbingan.where(nim: current_mahasiswa.nim)
    @babs = Bab.all
---
SELECT "bimbingans".* FROM "bimbingans" WHERE "bimbingans"."nim" = ?  [["nim", 19090]]
SELECT "babs".* FROM "babs"

  def create
    @bab = Bab.new(bab_params)
      @bab.pdf.attach(params[:bab][:pdf])
    respond_to do |format|
      if @bab.save
---
INSERT INTO "babs" ("nim", "nama", "bab", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nim", 19090], ["nama", "Andika"], ["bab", "1"], ["created_at", "2019-09-16 05:52:10.180610"], ["updated_at", "2019-09-16 05:52:10.180610"]]
INSERT INTO "babs" ("nim", "nama", "bab", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nim", 19090], ["nama", ""], ["bab", "2"], ["created_at", "2019-09-20 07:55:22.885318"], ["updated_at", "2019-09-20 07:55:22.885318"]]

  def update
    respond_to do |format|
      if @bab.update(bab_params)
---
UPDATE "babs" SET "nim" = ?, "updated_at" = ? WHERE "babs"."id" = ?  [["nim", 19090], ["updated_at", "2019-09-19 08:38:05.517305"], ["id", 5]]

  def destroy
    @bab.destroy
---
DELETE FROM "babs" WHERE "babs"."id" = ?  [["id", 2]]

    def set_bab
      @bab = Bab.find(params[:id])
---
SELECT "babs".* FROM "babs" WHERE "babs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]