app/controllers/bimbingans_controller.rb

SELECT "bimbingans".* FROM "bimbingans"
---
  def index
    @bimbingans = Bimbingan.all

INSERT INTO "bimbingans" ("judul", "created_at", "updated_at", "idb", "nim", "nip") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @bimbingan = Bimbingan.new(bimbingan_params)

    respond_to do |format|
      if @bimbingan.save

UPDATE "bimbingans" SET "nama" = ?, "dosen" = ?, "updated_at" = ? WHERE "bimbingans"."id" = ?  [["nama", "1"], ["dosen", "1"], ["updated_at", "2019-08-26 12:42:25.867280"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @bimbingan.update(bimbingan_params)

DELETE FROM "bimbingans" WHERE "bimbingans"."id" = ?  [["id", 3]]
---
  def destroy
    @bimbingan.destroy

SELECT "bimbingans".* FROM "bimbingans" WHERE "bimbingans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_bimbingan
      @bimbingan = Bimbingan.find(params[:id])