app/controllers/bimdosens_controller.rb

    def index
      @bimdosens = Bimbingan.where(nip: current_mdosen.nip)
---
SELECT "bimbingans".* FROM "bimbingans" WHERE "bimbingans"."nip" = ?  [["nip", 1090]]

    def show
      @bimdosen = Bimbingan.find(params[:id])
---
SELECT "bimbingans".* FROM "bimbingans" WHERE "bimbingans"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

      def set_bimdosen
        @bimdosen = Bimbingan.find(params[:id])
---
SELECT "bimbingans".* FROM "bimbingans" WHERE "bimbingans"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]