app/controllers/dosens_controller.rb

  def index
    @dosens = Dosen.all
---
SELECT "dosens".* FROM "dosens"

  def create
    @dosen = Dosen.new(dosen_params)
    @userd = Mdosen.new
    respond_to do |format|
      if @dosen.save
---
INSERT INTO "dosens" ("nip", "nama", "email", "username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_dosen
      @dosen = Dosen.find(params[:id])
      @userd = Mdosen.find(params[:id])
---
SELECT "dosens".* FROM "dosens" WHERE "dosens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "mdosens".* FROM "mdosens" WHERE "mdosens"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]