app/controllers/dsarans_controller.rb

SELECT "babs".* FROM "babs" WHERE "babs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "sarans" ("halaman", "isi", "bab_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["halaman", 1], ["isi", "terimakasih"], ["bab_id", 2], ["created_at", "2019-09-17 02:53:11.715462"], ["updated_at", "2019-09-17 02:53:11.715462"]]
---
  def create
  @hdosen = Bab.find(params[:hdosen_id])
  @komentar = @hdosen.sarans.create(comment_params)