app/controllers/filemhs_controller.rb

SELECT "filemhs".* FROM "filemhs"
---
  def index
    @filemhs = Filemh.all