app/controllers/hdosens_controller.rb

SELECT "babs".* FROM "babs" WHERE "babs"."nim" = ? LIMIT ?  [["nim", 19091], ["LIMIT", 1]]
---
    def index
      @zhilka = params[:nim]

      @hdosens = Bab.where(nim: @zhilka)

SELECT "babs".* FROM "babs" WHERE "babs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        @hdosen = Bab.find(params[:id])

UPDATE "babs" SET "progress" = ?, "updated_at" = ? WHERE "babs"."id" = ?  [["progress", "Lulus"], ["updated_at", "2019-09-19 02:29:41.410321"], ["id", 4]]
---
    def update
      respond_to do |format|
        if @hdosen.update(bab_params)

SELECT "babs".* FROM "babs" WHERE "babs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
      def set_bab
        @hdosen = Bab.find(params[:id])