app/controllers/sarans_controller.rb

  def create
  @bab = Bab.find(params[:bab_id])
  @komentar = @bab.sarans.create(comment_params)
---
SELECT "babs".* FROM "babs" WHERE "babs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "sarans" ("halaman", "isi", "bab_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["halaman", 1], ["isi", "oke"], ["bab_id", 2], ["created_at", "2019-09-16 06:57:48.882141"], ["updated_at", "2019-09-16 06:57:48.882141"]]

def destroy
  @bab = Bab.find(params[:bab_id])
  @komentar = @bab.sarans.find(params[:id])
  @komentar.destroy
---
SELECT "babs".* FROM "babs" WHERE "babs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "sarans".* FROM "sarans" WHERE "sarans"."bab_id" = ? AND "sarans"."id" = ? LIMIT ?  [["bab_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "sarans" WHERE "sarans"."id" = ?  [["id", 1]]