app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("nim", "nama", "email", "username", "password", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "nama" = ?, "updated_at" = ? WHERE "students"."nim" = ?  [["nama", "Jaka Wiguna"], ["updated_at", "2019-09-18 05:33:53.592313"], ["nim", 19091]]

    def set_student
      @student = Student.find(params[:id])
      @maha = Mahasiswa.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "mahasiswas".* FROM "mahasiswas" WHERE "mahasiswas"."id" = ? LIMIT ?  [["id", 19093], ["LIMIT", 1]]